In [1]:
import pandas as pd

In [2]:
data = {"name": ["a","b","c","d","a","c"] , "eng":[8,7,5,8,8,4] , "hindi" : [2,3,4,5,2,7]}
df = pd.DataFrame(data)

In [3]:
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    c    4      7

In [4]:
df["duplicates"] = df.duplicated()

In [5]:
df

  name  eng  hindi  duplicates
0    a    8      2       False
1    b    7      3       False
2    c    5      4       False
3    d    8      5       False
4    a    8      2        True
5    c    4      7       False

In [6]:
df.drop_duplicates(inplace=True)

In [7]:
df

  name  eng  hindi  duplicates
0    a    8      2       False
1    b    7      3       False
2    c    5      4       False
3    d    8      5       False
4    a    8      2        True
5    c    4      7       False